#coding:utf8

'''
访问代理等配置信息
'''

# 登录后的cookie，必填，验证登录态
COOKIE = ''

# 访问代理设置, 如无，则设置为空字典就行
PROXY = {
}

# 是否下载 mp3，由于下周音频比较耗时，可以选择性下载
NEED_MP3 = False

# 每篇文章下载间隔，单位秒，防止被限流或者 ip 被禁
INTERVAL = 1

# 初始的专栏列表，可以置空
ZHUAN_DICT = {
            110: '邱跃的产品实践',
            85: '趣谈网络协议',
            143: '程序员的数学基础课',
            140: 'Linux性能优化实战',
            126: '数据结构与算法之美',
            79: '技术领导力300讲',
            42: '技术与商业案例解析',
            113: '技术管理实战36讲',
            63: '赵成的运维体系',
            81: '从0开始学架构',
            48: '左耳听风',
            80: '硅谷产品实战36讲',
            139: 'MySQL实战45讲',
            133: '从0开始学大数据',
            116: '深入剖析Kubernetes',
        }
        
try:
    from local import *
except:
    pass